Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/classd.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CLASSD register API structure */
typedef struct
{
  __O   uint32_t                       CLASSD_CR;          /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       CLASSD_MR;          /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       CLASSD_INTPMR;      /**< Offset: 0x08 (R/W  32) Interpolator Mode Register */
  __I   uint32_t                       CLASSD_INTSR;       /**< Offset: 0x0C (R/   32) Interpolator Status Register */
  __IO  uint32_t                       CLASSD_THR;         /**< Offset: 0x10 (R/W  32) Transmit Holding Register */
  __O   uint32_t                       CLASSD_IER;         /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       CLASSD_IDR;         /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __IO  uint32_t                       CLASSD_IMR;         /**< Offset: 0x1C (R/W  32) Interrupt Mask Register */
  __I   uint32_t                       CLASSD_ISR;         /**< Offset: 0x20 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved1[0xC0];
  __IO  uint32_t                       CLASSD_WPMR;        /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved2[0x14];
  __I   uint32_t                       CLASSD_VERSION;     /**< Offset: 0xFC (R/   32) IP Version Register */
} classd_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_CLASSD_COMPONENT_H_ */
